Revit 2017 API
FabricationServiceButton Members
The FabricationServiceButton type exposes the following members.
Methods
Name | Description
ContainsFabricationPartType
 Checks to see if the fabrication part type exists on one of the button conditions.
Dispose
Releases all resources used by the FabricationServiceButton
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetConditionDescription
 Gets the description for the condition size range.
GetConditionImage
Gets the image for the specified fabrication service button condition.
GetConditionLowerValue
 Gets the condition lower value (valid if greater or equal) for a given condition index.
GetConditionName
 Gets the name of the specified condition on the fabrication service button.
GetConditionUpperValue
 Gets the condition upper value (valid if less) for a given condition index.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetImage
Gets the image for fabrication service button.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsUnrestrictedCondition
 Checks if the condition is unrestricted.
IsValid
 Checks if the button contains only valid fittings.
IsValidConditionIndex
 Validates if the given condition index is valid or not.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ButtonIndex
 The button index for this button.
Code
 The code of the button.
ConditionCount
 The number of conditions.
GroupIndex
 The group index for this button.
IsAHanger
 Checks if the fabrication service button is hanger.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the button.
ServiceId
 The fabrication service identifier for the fabrication service this button belongs to.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace